# St7SetCreepTemperatureInclude

Sets temperature dependency for the specified creep law definition, where applicable.

long St7SetCreepTemperatureInclude(long uID, long CreepID, bool Include)

Input Parameters

uID

Strand7 model file ID.

CreepID

Creep layout ID.

Include

True to include temperature dependent terms.